api/app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("title", "description", "status", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    task = Task.new(task_params)

    if task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "Done"], ["updated_at", "2025-05-12 09:37:14.117997"], ["id", 1]]
---
    task = Task.find_by(id: params[:id])
    if task
      if task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
    task = Task.find_by(id: params[:id])
    if task
      task.destroy