dev-test-api/app/controllers/api/v1/tasks_controller.rb

    task = Task.find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    task = Task.new(task_params)

    if task.save
---
INSERT INTO "tasks" ("title", "description", "status", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    task = Task.find_by(id: params[:id])
    if task
      if task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "due_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "this task is to be deleted. testinupdate"], ["due_date", "2025-06-05 15:00:00"], ["updated_at", "2025-05-21 16:01:20.902836"], ["id", 11]]

    task = Task.find_by(id: params[:id])
    if task
      task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 12]]